{"Directors":[{"Role":"Executive Director","Name":"Cari Schmidt","Email":"ceschmidt@umass.edu","Office_Hours_1":"Monday 3:30 - 4:30","Office_Hours_2":"Tuesday 11:30 - 12:30","Bio":"Hi Friends! My name is Cari and I am most excited to be your 2016 UMEMS Executive Director! I am a biology major from Sharon, MA planning on heading to PA school after UMass. Aside from working for UMEMS, I work for an ambulance company near home. I love to sit on the beach, weather permitting, and obsess over the Patriots. I'm happy to answer any UMEMS related questions. Feel free to stop by the office, even if just to chat!","Image":"http://www.umassems.org/assets/profile_photos/9/standardized/Cari_Schmidt-553c593d76d8a3ae125ea53f01b18ef8cbbc31a7a2a0fbb77052f1f9ed55142e.jpg"},{"Role":"Director of Operations","Name":"Kimberly Vermilya","Email":"doumassems@gmail.com","Office_Hours_1":"Thursday 3:00 - 5:00","Office_Hours_2":"","Bio":"Hello! My name is Kim and I look forward to meeting and working with you all this year. I am a UMass Junior studying Kinesiology and Biology on the Premed track. I took my EMT-B class through UMEMS in Fall 2013, and joined UMEMS a year later. I am from Arlington, MA and work at a private ambulance company out there. Although I will do my best to answer any of your questions, be sure to let me know if you have questions related to shifts, equipment, or any other day to day operations of UMEMS. Stop by my office hours to say hi, or for a shift orientation!","Image":"http://www.umassems.org/assets/profile_photos/16/standardized/KimUMEMS-67cc3c0f95738fd288572a5f5c994f2fd5f5a43514c346f51896090aa53d136e.jpg"},{"Role":"Director of Finance","Name":"Ilana Shecter","Email":"dfumassems@gmail.com","Office_Hours_1":"Tuesday 11:30 - 12:30","Office_Hours_2":"Wednesday 1:30 - 2:30","Bio":"Hello! My name is Ilana and I am excited to serve as UMass EMS' Director of Finance. I am a sophomore Biochemistry and Molecular Biology major on the Premed track. I took the EMT-B class through UMEMS in Fall 2014, and joined UMEMS the following semester. I'm from Natick, MA and work for a private ambulance company that serves Boston and the South Shore. When I'm not in the office or working in Boston, you can find me tutoring Orgo, playing soccer, or getting lost in the great abyss that is Spotify. Please stop by my office hours to say hi!\n","Image":"http://www.umassems.org/assets/profile_photos/17/standardized/IlanaUMEMS-cb2da2bb9bbb6efc14ea2f695ee2a9aeb2bbbaa980bf58d3443d800c862d0569.jpg"},{"Role":"Director of Administration","Name":"Sean Doherty","Email":"daumassems@gmail.com","Office_Hours_1":"Monday 4:00 - 5:00","Office_Hours_2":"Wednesday 4:00 - 5:00","Bio":"Howdy! My name is Sean and I have the privilege of serving as the UMEMS Director of Administration. I am a Psychology major on the Neuroscience track, from Mansfield, MA, and planning on a medical career after Umass. I have been an EMT since 2014 and work for a private ambulance company in Boston. When not working or at school I like to spend all of my free time at the beach and not really anywhere else. Please feel free to send any questions my way or stop by my office hours!\n","Image":"http://www.umassems.org/assets/profile_photos/19/standardized/SeanUMEMS-f82d316044f693cb5f8c5e51172302f901729edffc2fbd427cf695cfcd842240.JPG"},{"Role":"Director of Training","Name":"Michelle Monahan","Email":"dtumassems@gmail.com","Office_Hours_1":"Wednesday 1:00 - 2:00","Office_Hours_2":"Thursday 3:30 - 4:30","Bio":"Hi everyone! I'm Michelle and I am excited to be your Director of Training! I am a junior here in the College of Nursing and I'm originally from Walpole, MA. I got my EMT-B license in 2014 and currently work on a private ambulance in and around Boston. I look forward to running many drills and training opportunities for us all to further our knowledge and practical skills! As always, please visit me during my office hours or email me with any training ideas you would like to make happen!\n","Image":"http://www.umassems.org/assets/profile_photos/18/standardized/MichelleUMEMS-dc0000004f26f671bffb61058d3f60ef45ac07a2880dcbf183c2286f75a35a62.jpg"}],"Staff":[{"Role":"Parliamentarian","Name":"Charlotte LaPlante","Email":"claplante@umass.edu\n\n","Bio":"Hi Everyone! My name is Charlotte and I am very happy to be the Parliamentarian for UMass EMS this year. I am a sophomore biology major from Brookline, MA. I took the EMT-B class here at UMass during the fall of 2014 and started working for UMEMS the following semester. I really enjoy running and working in the research lab I am a part of. I don't have office hours, but feel free to contact me with any questions related to the UMass EMS Charter.\n","Image":"http://www.umassems.org/assets/profile_photos/22/standardized/CharlotteUMEMS-a7680bf62252a2472e86d63611b1ca4dfee6ec992ddcd4ae2758d0e5dbc64049.JPG"},{"Role":"Initial Training Liaison","Name":"Caterina Singas","Email":"csingas@umass.edu","Bio":"Hello everyone! My name is Caterina and I am the 2016 UMEMS Initial Training Liaison (ITL). I'm a Biology major from Jefferson, Massachusetts. If I'm not working for UMEMS, you can find me on a truck for my private company back home. I do not have office hours, but I am easily reachable through email! Feel free to send any questions regarding the EMT class my way.\n","Image":"http://www.umassems.org/assets/profile_photos/20/standardized/image1-f3b60fd7c6ec850669e287d1d9eda01fc018b56486976368538a369986d4cbcd.JPG"},{"Role":"CPR Chair","Name":"Eric Casinelli","Email":"ecasinelli@umass.edu","Bio":"Hello. My name is Eric and I am the CPR Chair of UMass EMS. I am a freshman from Quincy, MA. I am a Psychology major on the Neuroscience track with a double minor in Chemistry and Statistics. I am also on the Pre-Med track. I took my EMT-B class with Boston EMS and I got my certification last year while I was in high school. When I'm not at UMass, I work for a private ambulance company in Boston and the South Shore of MA. I like to spend my time at the gym or obsessing over Game of Thrones. I do not hold any office hours, but if you need to reach me feel free to email me with anything CPR related.\n","Image":"http://www.umassems.org/assets/profile_photos/21/standardized/EricUMEMS-d49eb8cc3dcc899ca68672b7335a73f9b5dbfabb4f71d34529bb430edf23d0fa.jpg"},{"Role":"EMS Coordinator","Name":"J. Dominic Singh","Email":"jdsingh@ehs.umass.edu","Bio":"Dominic Singh has been an active EMS provider for 18 years, the last 14 at the paramedic level. He has worked for a variety of collegiate, private, fire department, and non-profit EMS agencies throughout Massachusetts. He still works actively for both the Amherst Fire Department and Spencer EMS. He was hired as the first dedicated EMS Coordinator to UMass Amherst EMS in May of 2013.\n","Image":"http://www.umassems.org/assets/profile_photos/11/standardized/Dominic_Sing_Photo-d5f0b52965b3cee1c4268e49218567e0966a39d05aac3c55a517be0a190e5a06.jpg"},{"Role":"IT Specialist","Name":"Todd Morse","Email":"rmorse@umass.edu","Bio":"Hello. My name is Todd and I computer science major and a Junior. I have been with Umass EMS for about a year now and I am excited to be the IT specialist. I have a lot of new ideas to improve our information technology and I hope I can make our technology experience simple, good-looking, and professional. Please always feel free to get in touch with me. I generally answer emails pretty quickly.\n","Image":"http://www.umassems.org/assets/profile_photos/3/standardized/Todd_Morse_Photo-7e622181cd59e3d7d9a1ff9102a3f0400218e1eed47257f8b6e39f6a99822b11.jpg"}],"Class":[{"Term":"Fall","Year":2016,"Open":"Open","Offered":"No"}],"Content":[{"Title":"About Us","Page":"About","Content":"Established in 1953, UMass EMS is a university agency consisting of undergraduate students (occasionally graduate students as well) employed through the department of Environmental Health and Safety. Originally founded as a volunteer fire department, the organization has grown over the years from \"Fire and First Aid\" responsibilities to Event Standby, as various departments at UMass recognize the need for public safety. Currently, there are approximately 80 members who work as EMTs and Fire Marshals at most on-campus events. These include sporting events (basketball, football, and hockey), rock concerts, theater performances, as well as a variety of other events. Member responsibilities primarily involve providing first aid to participants and spectators as necessary and performing building fire safety inspections prior to the events (for theater and concert hall performances). We are also involved in training the campus community in CPR via our Mission CPR Program, which provides classes open to the public ranging from Bystander to Healthcare Provider CPR. All members of UMass EMS must be certified in the Commonwealth of Massachusetts at the level of EMT-Basic or above. Additionally, our members assist in teaching an EMT-B course offered on the UMass campus.\n\nThe number of patients we see during a detail is largely dependent upon the type of event. During theater performances, for instance, the patient volume is much lower, so one of our primary duties is performing fire safety inspections. Our patient volume increases a great deal for large sporting events or rock concerts held at the Mullins Center. For these types of events, we function as first responders in the EMS system with our own equipment or equipment housed at the facility. We see a mix of walk-in patients and patients to whom we are dispatched by event staff or the UMass Police Department (UMPD). We are in radio contact with UMPD and the fire inspector on duty and often work in conjunction with Amherst Fire Department (AFD) paramedics during concerts. For larger events, we staff both a primary first aid room and triage room for patients awaiting the next available transportation. This transportation is provided by Amherst Fire Department (AFD).\n\nWe hope to continue our growth in the years to come by recruiting qualified EMTs who are already members of the campus community and by covering more and more events around campus. We also hope to continue educating students and faculty about the importance of safety throughout the campus and community."},{"Title":"Funding","Page":"About","Content":"We are able to operate through support from other organizations on campus. EH&S allows us use of their vehicles for transportation of equipment to events and supplies us with radios, the SGA provides us with much of our non-revenue-based funding, and UHS provides us with some of our disposable medical supplies, oxygen refills, and takes care of our biohazard disposals. UMass EMS purchases much of its own equipment, with money from its revenue and SGA funding accounts. For events in which the anticipated demand exceeds our supplies, we have been able to borrow additional supplies from the Amherst Fire Department. In February 2012, our unit achieved Agency status through the SGA in which we received an expanded budget, allowing for more advertising and state of the art equipment.\n\nThe money necessary for the maintenance and improvement of our equipment, then, comes from revenue from the EMT Training class offered each semester and profits from CPR classes that are taught by unit members and open to the public. One notable aspect of our service is that our care is free of charge to our patients. The sponsors of the event always pay our wages, which are independent of the number of patients treated."},{"Title":"Unit Organization and Operation","Page":"About","Content":"The unit is run by our board of directors, who are voted into office every December. There are five positions: Executive Director, Director of Operations, Director of Finance, Director of Administration, and Director of Training. The directors are supported by an administrative staff consisting of a Parliamentarian, a CPR Chair, an Initial Training Liaison, and an IT specialist. These positions are assigned each academic year by the board of directors. An EMS coordinator also advises the board of directors and supports the organization. As of 2015 the membership is divided into divisions, each with a Division Head and those divisions are divided into units, each with a Field Supervisor. These division heads and field supervisors are also appointed by the board of directors each calendar year.\n\nMeetings are held every two weeks for detail scheduling or in-house training, and the Board of Directors holds meetings before general meetings as well as informal meetings on off-weeks. Detail assignment priority is determined by a point system, where members earn points based on the number of details worked or volunteer work since the last scheduling meeting."},{"Title":"Expectations","Page":"Join","Content":"Attend a fornightly informational and training meetings\n\nSpend an absolute minimum of four hours per two weeks contrubuting to UmassEMS\n\nAttend mandatory training sessons"},{"Title":"Applicant Requirements","Page":"Join","Content":"**Current undergraduate, graduate, or continuing education student at Umass Amherst**\n\n**MA EMT certification (EMT-Basic minimum)**\n\n**CPR (BLS for health care providers) certification**\n\nWant to get CPR certified? Check out our [CPR classes](http://www.umass.edu/#/cpr \"CPR Class\")\n\n**Poses a valid US Driver's License**\n\n**Pass both Written and Practical EMT-B standardized exams, taken at Orientation**"},{"Title":"How to Become a Full Member","Page":"Join","Content":"1. Make sure you satisfy the membership requirements.\n2. Make sure you are comfortable with the list of expectations.\n3. Fill out our [application form](https://goo.gl/forms/3PuSxRmJjm0pjouh1).\n4. Wait for UmassEMS to contact you with the date of the next orientation. These are typically held in early fall or spring.\n5. Demonstrate sufficient skills during the orientation.\n6. Start as a probationary member. This means you can now work with a non-probationary member.\n7. Fulfill the shift, patient contact, and training requirements necessary to become a full member.\n8. Complete a full member interview before our board of directors."},{"Title":"About Our Class","Page":"Class","Content":"Our EMT class will prepare you to obtain the certification of Massachusettes EMT-Basic and become a Nationally Registered EMT. To obtain these certifications you must take the National Written EMT Exam as well as the Massachusettes State Psychomotor Skills Verification. Even though this is not a credit course it is as demanding as many other college courses with weekly textbook readings and comprehensive exams. The class consists of approximately 150 hours, split between didactic lectures and hands on learning, where practical skills will be learned and perfected. Online course work will supplement in class material. Current and former UMass EMS EMTs volunteer as teaching assistants throughout the class as well. You may take the Written and Psychomotor Exam after successful completion of the class. In order to work in the field as a provider, one will need to undergo the reciprocity process to acquire a state EMT- B license for the state that they wish to work in. It is up to that specific individual to obtain the state certification through the OEMS (Office of Emergency Medical Services) of the desired state. It is also up to that specific individual to obtain employment as an EMT-Basic. EMT certification is valid for approximately two years at both the National Registry and state level after successfully passing the certification exam. In order to maintain certification, all EMTs must take continuing education classes for approved credit and a refresher course within this two year cycle in order to be eligible for recertification. More detailed information on EMT certification and re-certification in Massachusetts can be found online through the Commonwealth's [Office of Emergency Medical Services](http://www.mass.gov/eohhs/gov/departments/dph/programs/hcq/oems/ \"OEMS\")."},{"Title":"Quick Facts","Page":"Class","Content":"**Cost:** $900\n\n**Sessions:** Fall, Spring\n\n**Meeting times:** Tuesdays and Thursdays 6:00 pm - 10:00pm and some Sundays\n\n**Location:** Draper Hall, Umass Amherst\n\n**Credits:** Not eligible for credit (not affiliated with any university)\n\n**Workload:** The workload of this class is equivalent to the workload of at least two standard 3-4 credit classes\n\n**Certifications Earned:** MA EMT-Basic, NREMT EMTB, Healthcare Providers CPR (additional $30)\n\n**Financial Aid:** Not elligable\n\n**Open to:** Anyone able to obtain Massachusettes EMT-Basic Certification"},{"Title":"How to Register","Page":"Class","Content":"1. Wait for registration to open (this will usually happen a month or so before the start of Fall semmester and Spring semmester)\n2. Download the Class registration form complete it\n3. Mail the completed form, a $100 check Payable to \"UMASS EMS\", and a $300 check Payable to \"PECE\" to our address (this will hold your place in the class):\n\n*UMass EMS, c/o Environmental Health and Safety*\n\n*Draper Hall University of Massachusetts*\n\n*Amherst, MA 01003*\n\n4. Wait to be contacted confirming your spot is being held in the class\n5. Be prepared to pay an additional $500 upon beginning the class"},{"Title":"Mission CPR","Page":"CPR","Content":"Mission CPR is UmassEMS' initiative to certify as many students, faculty, and members of the surrounding community in CPR as possible. Our classes are not just for members of the Umass community. Anyone can sign up. Follow the instructions below for details. All of our classes are taught by certified Massachusetts Emergency Medical Technicians who have special training and additional certification in CPR instruction. All of our instructors are highly experienced and knowledgeable in CPR instruction and take pride in giving each student a fun and educational experience. This is a great group activity for any RSO, athletics team, or other group of people who wants to learn a valuable skill that could really help someone some day!"},{"Title":"How to Sign Up","Page":"CPR","Content":"**Individual Sign-up:** Anyone who wishes to take a Heartsaver CPR/AED course may sign up ahead of time, or walk in, at the prices listed below. Simply send us an inquiry via email to UMassEMSMissionCPR@gmail.com and we will contact you with information and class details. Signing up 48 hours in advance grants a guarunteed spot in the class and a discount. Once you recieve an email from us be sure to confirm your spot.\n\nPlease include the following information in your email:\n\n* Name\n* Desired class/date\n* Email address\n* Permanent mailing address\n* Phone number\n\n**Group Scheduling:** To schedule a group of 15 or more for a session not already scheduled, come talk to us in our office in Draper Hall Annex or contact us via email at UMassEMSMissionCPR@gmail.com. *Check Discount Section for special offers."},{"Title":"Courses Offered","Page":"CPR","Content":"**Heartsaver CPR:** This 3 to 4 hour course is the standard and most cost effective CPR course for anyone who wants to learn the basics of CPR and AED use. We offer this course as a volunteer, non-profit initiative to certify everyone on campus in CPR. UMass EMS wants to make the campus a more heart-safe community. This course is not the same as Healthcare Provider CPR and cannot be used if you are an EMT, nurse, or other medical professional. Check with your employer to make sure the “AHA Heart Saver CPR AED” course is the correct one to take.\n\n**Healthcare Provider:** This course is a 4 to 5 hour long course and is needed for all medical professionals. The course covers more advanced skills such as Bag Valve Mask (BVM) ventilations, pulse location, and infant CPR. This course offers a better rounded understanding of CPR and AED use in comparison to the Heart saver course. To sign up, please email us or come visit our office to see when the next scheduled class is.\n\n**First Aid / CPR AED:** This course is a 5 to 6 hour long course that not only covers Heart Saver CPR and AED material but also teaches first aid techniques that may help stabilize a patient prior to further healthcare. Splinting, bleeding control, and heat exhaustion first aid are only a few of the techniques taught in this course. This course is needed in many professions and is a great course to take if you partake in outdoor activities. To sign up, please email us or visit our office to see when the next scheduled class is."},{"Title":"Discounts","Page":"CPR","Content":"**Early Payment:** Paying in advance at least 24 hours before the class starts will give you a $5 discount. Please submit payments to a UMass EMS member the Draper Annex. Please enclose your payment in a sealed envelope with your name, class date, and \"CPR Class\" written on the front of the envelope. Deposits are non-refundable. You may take the same type of class at a future date in that semester without paying again.\n\n**Nursing Students and EMT’s:** UMass School of Nursing students and EMT’s get a $10 discount off of the Sign-up Ahead price for the AHA Healthcare Provider course.\n\n**Group Sign up Discount:** Groups of 8 or more get the same discounted rates as Nursing students."},{"Title":"FAQ","Page":"Info","Content":"**Will my shift preferences be saved accross devices?**\n\nNo, unfortunately we don't support that nor do we have plans to. \n\n**How long does it take for filled shifts to be removed from the list?**\n\nAbout 3 seconds.\n\n**What times do you mean by morning, afternoon, and evening?**\n\nThese times are based on call times (so shifted 20 minutes). The start times are as follows: \n- Morning: 0340\n- Afternoon: 1140\n- Evening: 1740\n\n**Information isn't showing up on the page, should I click the page again or refresh?**\n\nYou can if you'd like but it won't make it any faster. Refreshing might actually make it slower.\n\n**Why does the information on pages take so long to load?**\n\nThis website is powered by a google sheet. Every time you load the website it must read information from the sheet and add it to the pages. Once this happens you can move between pages quickly.\n\n**Do you use cookies? If so why?**\n\nYes, we use a single cookie to save your shift preferences. Without accounts it's the only way to save your preferences. "},{"Title":"About this Website","Page":"Info","Content":"**Web Master**: Todd Morse\n\nTools Used:\n- Angular\n- SASS\n- Babel\n- Gulp\n- Bower\n- Marked\n\nResponsive design made possible with function from [detectmobilebrowsers.com](http://detectmobilebrowsers.com/) check them out for great open sourced responsive deisgn functions. \n\nBackend:  Google Sheet\n\nLearn how to set this up a Google Sheet backend with JSON with [this](https://mashe.hawksey.info/2014/07/google-sheets-as-a-database-insert-with-apps-script-using-postget-methods-with-ajax-example/) awesome guide"},{"Title":"Group Photo","Page":"Home","Content":"https://lh3.googleusercontent.com/bE7U9_62ZBK16HvW57X5uBQE8jWgs_1n53FRhBl1PosBBnH--Jla3p2tBezcmcCuDAIQg46pmzfrjgSkeROo-MWOo2M26F4j9d5T-UL0SFxrcSYRc2lrwoNQpztEnVYB4lq4bL9Zu3eDztBUMnBQDA3DI3INJHUa3I_KIA52EQ2ThW0M2XHQU-WfeR5aXZuM_hULT3YD1ODHXq4entOLvaZlxzZ5pqQd-ln13T2Wbm0EiCA1R3eCmAfDd9Dti0dx3LW4iKRAsTLx1jpjF1NtDSh6jb9t6AxOu33ij2uFang9p-qRE7TkBVHzRejrtQaLNlPOCbd-K13hbu9o6JK2TJFNJy9iB3InsjkBtglg5IkgGOznePwcwuRTRJG9gUdTF-tKfI9Crgbz6nJOyKXJfhllQprIb7LUUBu15SCRdaZ4vyUeN1AKrwHpuIZKlrbnJYtWIG1n56t0ST-2vJJhgdwjM8Cqzs-mmk7ExYRJeqqsfeVhL9HJJvu6_bjWzIVKNG2dxsxS-YBwr-scICMnzPuYxpq96KYHmUO4F2zCqETMKBd17UdPkyZnyIYQeBg7RU1pGE-yEl4-EKT9hWAnUZdCXLsm-A=w1909-h969-k"}],"CPR Costs":[{"Class":"Heart Saver CPR/AED","Cost":55},{"Class":"Healthcare Provider","Cost":65},{"Class":"CPR/AED with First Aid","Cost":80}]}
